Revit 2027 API
PlanCircuitSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual PlanCircuitSetIterator ForwardIterator()
Public Overridable Function ForwardIterator As PlanCircuitSetIterator
public:
virtual PlanCircuitSetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> PlanCircuitSetIterator
override ForwardIterator : unit -> PlanCircuitSetIterator
Return Value
PlanCircuitSetIterator
Returns a forward moving iterator to the set.
See Also
Reference
PlanCircuitSet Class
Autodesk.Revit.DB Namespace